[
  {
    "id": "k1",
    "title": "Kapitel 1: Und was machst du?",
    "description": "Sich vorstellen, über Vergangenes berichten, sich verabreden.",
    "lessons": [
      {
        "id": "l1",
        "title": "Über sich sprechen",
        "type": "reading",
        "content": "Meine Eltern sind schon Rentner und leben auf dem Land. Ich habe einen Bruder und eine Schwester. Mein Bruder ist geschieden und hat eine Tochter. Sie ist total süß. Meine Schwester hat noch keine Kinder. Ich auch nicht, aber in ein paar Jahren möchte ich gern Kinder haben.\n\nNach der Schule habe ich eine Ausbildung gemacht und jetzt arbeite ich als Bankkauffrau. Ich habe nette Kollegen und meine Arbeit macht mir Spaß. Aber vielleicht studiere ich auch noch an der Uni, mal sehen."
      },
      {
        "id": "l2",
        "title": "Sprachen und Wohnen",
        "type": "reading",
        "content": "Meine Mutter kommt aus Österreich und mein Vater ist in Italien geboren. Ich habe also zwei Muttersprachen und spreche Italienisch und Deutsch fließend. Ich habe auch Englisch und Französisch gelernt, aber Französisch spreche ich nur ein bisschen.\n\nIch komme aus Basel und lebe jetzt in Zürich. Meine Freundin und ich haben ein Apartment im Stadtzentrum. Wir haben es zusammen renoviert. Es ist klein, aber schön. Uns gefällt das Leben in der Stadt, aber manchmal ist es auch ein bisschen laut und stressig."
      },
      {
        "id": "l3",
        "title": "Freizeit",
        "type": "reading",
        "content": "Ich treffe gern meine Freundinnen und Freunde. Dann kochen wir zusammen oder gehen ins Restaurant. Ich mache auch gern Sport. Ich spiele Basketball und ich reite. Meine Eltern haben ein Pferd. Am Wochenende auf dem Sofa liegen und ein gutes Buch lesen - das finde ich auch toll."
      }
    ]
  },
  {
    "id": "k2",
    "title": "Kapitel 2: Das letzte Jahr",
    "description": "Perfekt verwenden, über Vergangenes berichten.",
    "lessons": [
      {
        "id": "l1",
        "title": "Julia: Prüfung, Urlaub und ein Fest",
        "type": "reading",
        "content": "Das letzte Jahr war echt spannend. Es ist viel passiert. Ich habe meine Ausbildung zur Augenoptikerin beendet. Im Juni habe ich meine Prüfungen geschrieben. Ich habe sehr viel gelernt. Das war natürlich stressig. Zum Glück habe ich gute Noten bekommen.\n\nDann bin ich mit einer Freundin nach Spanien geflogen. Lilly hat früher dort gelebt und spricht perfekt Spanisch. Wir haben ein Auto gemietet und sind drei Wochen lang durch das Land gefahren. Wir haben auch Lillys Freunde in Madrid besucht.\n\nIm August hat meine Schwester geheiratet und ich habe mit ihr zusammen das Fest organisiert. Das war viel Arbeit, aber die Hochzeit war wirklich romantisch. Viele Freunde und Verwandte sind gekommen und wir haben zusammen gefeiert."
      },
      {
        "id": "l2",
        "title": "Jonas: Leben und studieren in Zürich",
        "type": "reading",
        "content": "Ich bin letztes Jahr umgezogen, wohne jetzt in Zürich und studiere Biologie. Im Herbst habe ich mein Studium angefangen. Zuerst habe ich keine Wohnung gefunden, aber ich habe immer weitergesucht und jetzt habe ich ein Apartment im Zentrum. Das hat mir gleich gefallen.\n\nMeine Freundin ist dann auch nach Zürich gekommen, sie studiert Mathematik. Vorher hat sie in Bern gewohnt, aber jetzt leben wir zusammen. Für zwei Leute ist die Wohnung etwas klein, aber es geht. Wir sind sehr aktiv und haben schon viele Leute kennengelernt, das ist toll.\n\nUnd ich habe jetzt ein neues Hobby: Ich spiele Tennis. Ich habe an einem Kurs teilgenommen und es macht wirklich Spaß. Vielleicht melde ich mich bald in einem Verein an."
      }
    ]
  },
  {
    "id": "k3",
    "title": "Kapitel 3: Wollt ihr kommen?",
    "description": "Sich verabreden, etwas begründen mit weil.",
    "lessons": [
      {
        "id": "l1",
        "title": "Bens Einladung",
        "type": "dialogue",
        "content": "Ben: Es ist so schön in Oberstdorf. Aber morgen fahr ich wieder zurück. Wollt ihr morgen Abend kommen? Es gibt Spezialitäten aus dem Allgäu.\n\nFelix: Lang nicht gesehen. Komme gern. Kann ich was mitbringen?\nBen: Aber sicher. Kein Problem. Und bring Taiga mit!\n\nMarvin: Ich kann erst später, muss arbeiten. Überstunden! Ist das auch okay?\nBen: Oh, das ist aber schade. Was ist denn los?\n\nLea: Danke für die Einladung. Ich kann leider nicht. Besuche meinen Vater. Er hat die Grippe."
      },
      {
        "id": "l2",
        "title": "Begründungen mit weil",
        "type": "reading",
        "content": "Ben schreibt den Freunden, weil er sie zum Essen einladen will.\nFelix kommt gern, weil er Ben lang nicht gesehen hat.\nMarvin kommt später, weil er arbeiten muss.\nMarvin bringt seinen Hund mit, weil Ben ihn gern mag.\nLea kann nicht kommen, weil sie ihren Vater besucht."
      }
    ]
  },
  {
    "id": "k4",
    "title": "Kapitel 4: Nach der Schulzeit",
    "description": "Über die Schulzeit sprechen, Modalverben im Präteritum.",
    "lessons": [
      {
        "id": "l1",
        "title": "Schule - eine schöne Zeit?",
        "type": "reading",
        "content": "Ich wollte immer erwachsen sein. Das verstehe ich jetzt gar nicht mehr. In der Schule hatte ich so viel Freizeit. Und sechs Wochen Sommerferien! Da musste man nichts machen und konnte immer ins Schwimmbad fahren.\n\nIch bin erst mit 14 Jahren nach Deutschland gekommen. Am Anfang war es schwer, ich konnte ja die Sprache nicht richtig sprechen. Aber nach ein paar Monaten hatte ich viele Freunde und dann war alles gut. Ich hatte mit ihnen immer einen Riesenspaß! Hauptsache, wir konnten uns jeden Tag sehen."
      },
      {
        "id": "l2",
        "title": "Schulregeln",
        "type": "reading",
        "content": "Wer kennt noch die Englischlehrerin Frau Lindner? Wir sollten jeden Tag 30 Wörter lernen und mussten dreimal pro Woche einen Vokabeltest schreiben. Man durfte keinen Fehler machen, sie war sofort wütend. Zum Glück hatte ich auch tolle Lehrer und der Direktor war nett!\n\nIch musste jeden Tag schon um sechs Uhr aufstehen. Schrecklich! Ich habe auf dem Land gewohnt und musste mit dem Bus um sieben Uhr zur Schule fahren."
      }
    ]
  },
  {
    "id": "k5",
    "title": "Kapitel 5: Nach dem Schulabschluss",
    "description": "FSJ, Ausbildung und Studium verstehen.",
    "lessons": [
      {
        "id": "l1",
        "title": "Schule aus - und nun?",
        "type": "reading",
        "content": "Maike, 19, macht ein FSJ (Freiwilliges Soziales Jahr). Sie betreut Menschen mit Behinderung.\n\nVida, 17, macht eine Ausbildung zur Gärtnerin. Sie lernt einen Beruf und macht eine Lehre.\n\nSara, 21, studiert Jura. Sie besucht Vorlesungen an der Universität und lernt in der Bibliothek."
      },
      {
        "id": "l2",
        "title": "Meinungen sagen",
        "type": "dialogue",
        "content": "Vida: Wie gefällt dir das Studium in Leipzig?\nAlex: Gut! Wann machst du den Schulabschluss?\nFabian: Ich möchte nicht gleich mit dem Studium anfangen. Ich brauche eine Pause.\nVida: Das finde ich gut. Du könntest ein FSJ machen.\nFabian: So einfach ist das nicht. Ich denke, ich möchte keine Zeit verlieren.\nVida: Das sehe ich anders. Eine Pause nach der Schule ist wichtig."
      }
    ]
  },
  {
    "id": "k6",
    "title": "Kapitel 6: Medien",
    "description": "Über Medien sprechen, Vor- und Nachteile diskutieren.",
    "lessons": [
      {
        "id": "l1",
        "title": "Was machen Sie mit dem Handy?",
        "type": "reading",
        "content": "Welche Medien und Geräte haben Sie gestern benutzt? Der Computer, der Laptop, das Radio, der Fernseher, die Zeitung, die Zeitschrift, die VR-Brille, die Smartwatch, das Tablet...\n\nWas machen Sie wie oft mit dem Handy? E-Mails checken, Zeitung lesen, mit Freunden sprechen, Radio hören, bezahlen, fernsehen, Musik hören, etwas downloaden, spielen, Nachrichten schicken, chatten, Serien sehen, ein Rezept lesen, Tickets kaufen, telefonieren, lernen."
      },
      {
        "id": "l2",
        "title": "Was ist besser?",
        "type": "dialogue",
        "content": "Person A: Kauf doch ein Tablet. Das ist viel leichter als ein Laptop. Und billiger ist es auch.\nPerson B: Findest du? Auf dem Laptop kann man aber besser schreiben und der Bildschirm ist größer.\nPerson A: Aber ein Laptop kostet mehr als ein Tablet. Tablets sind praktischer als Laptops.\nPerson B: Das stimmt. Aber ich arbeite lieber mit einem Laptop."
      }
    ]
  },
  {
    "id": "k7",
    "title": "Kapitel 7: Das mache ich am liebsten",
    "description": "Superlativ verwenden, Interviews machen.",
    "lessons": [
      {
        "id": "l1",
        "title": "Gloria: Informatik-Studentin",
        "type": "reading",
        "content": "Ich studiere seit drei Jahren an der Uni. Meine Informatik-Professorin finde ich am interessantesten, weil es bei ihr nie langweilig ist. Wir machen jetzt zum Beispiel ein Projekt: Wir entwickeln eine App für Studierende zum Thema ,Günstig leben'. Zuerst haben wir eine Umfrage gemacht, jetzt programmieren wir die App.\n\nSpäter möchte ich mit zwei Freunden ein Start-Up gründen. Wir wollen Apps mit Tipps für das ,normale' Leben entwickeln und so Menschen helfen, denn das finde ich am wichtigsten.\n\nIn meiner Freizeit bin ich weniger online als meine Freunde. Ich bin am liebsten draußen in der Natur und treffe Menschen. Das ist für mich am schönsten."
      },
      {
        "id": "l2",
        "title": "Lars: Fotograf",
        "type": "reading",
        "content": "Ich wollte unbedingt Fotograf werden, weil ich Fotos liebe und schon als Kind gern fotografiert habe. Nach der Schule habe ich eine Ausbildung zum Fotografen gemacht - das war viel spannender als die Schule.\n\nAm Anfang hat mir die Ausbildung nicht gefallen, weil ich vieles noch nicht konnte. Jetzt habe ich schon lange ein Studio und mache am liebsten Fotos von Tieren. Für so ein Foto brauche ich viel Vorbereitung und natürlich auch nach dem Shooting viel Zeit am Computer.\n\nDas dauert manchmal lang, aber ich mache das total gern. Meine Fotos sollen perfekt sein und die Menschen glücklich machen - dann bin ich selbst am glücklichsten!"
      }
    ]
  },
  {
    "id": "k8",
    "title": "Kapitel 8: Fotos posten",
    "description": "Meinungen verstehen, dass-Sätze bilden.",
    "lessons": [
      {
        "id": "l1",
        "title": "Immer und überall",
        "type": "reading",
        "content": "Carla Riemer: Also, ich finde mein Handy sehr praktisch. Aber ich finde es zum Beispiel echt blöd, dass manche Leute jede Aktivität mitteilen. Was soll das? Es interessiert mich nicht, dass eine Freundin ein Käsebrot in den Bergen isst. Ich möchte, dass sie mich anruft und mir alles erzählt. Es nervt, dass die Leute Fotos immer an alle schicken. Sie wollen doch nur zeigen, dass sie super aktiv sind.\n\nKonstantin Bührer: Ich finde es sehr gut, dass man immer Kontakt mit Freunden hat. Gestern war ich zum Beispiel auf einem Konzert. Das war super. Meinen Freunden hat gefallen, dass ich gleich Fotos vom Konzert gepostet habe. Ich habe ganz viele Likes bekommen. Ich mag es, dass ich alles sofort mit meinen Freunden teilen kann."
      },
      {
        "id": "l2",
        "title": "Mehr Meinungen",
        "type": "reading",
        "content": "Nadica Horvat: Ich finde es toll, dass man Freunde und Bekannte so schnell und einfach informieren kann. Aber ich finde, dass das Handy nicht immer an sein muss und man zum Beispiel nicht jede Party posten muss. Das ist oft peinlich! Ein Kollege von mir hat zum Beispiel im Büro angerufen und gesagt, dass er krank ist. Am Abend hat er dann ein Foto gepostet: Er mit Freunden auf einer Party. Er hat vergessen, dass seine Kollegen und seine Chefin das Foto sehen können. Jetzt sucht er einen neuen Job.\n\nFerdinand Weisensee: Also, ich sehe das alles sehr kritisch. Ich finde es ja okay, dass man Fotos und Videos posten kann. Und es ist auch schön, dass die Oma jeden Tag ein Foto von ihrem Enkel sehen kann. Aber ich finde es gar nicht gut, dass viele Leute Fotos von ihren Kindern posten. Die Kinder können nicht sagen, dass sie das nicht wollen. Ich denke, dass die Leute da vorsichtig sein sollen."
      }
    ]
  },
  {
    "id": "k9",
    "title": "Kapitel 9: Kino! Kino!",
    "description": "Filme beschreiben und kommentieren.",
    "lessons": [
      {
        "id": "l1",
        "title": "Filmbeschreibungen",
        "type": "reading",
        "content": "Club der roten Bänder: Sechs Jugendliche, sechs Leben mit Problemen und Sorgen - alles ganz ,normal'. Am Anfang kennen sie sich nicht. Ihre Leben sind so verschieden, dass man nicht weiß, wie und warum diese Jugendlichen Freunde werden können. Aber alle haben ein Schicksal: Eine Krankheit oder ein Unfall und plötzlich ist alles anders. Im Krankenhaus werden die Jugendlichen ,Der Club der roten Bänder'.\n\nIst das Leben langweilig?: Charlie ist Lehrerin. Sie lebt zusammen mit ihrem Freund Marco in Berlin. Sie mag Marco, aber sie merkt, dass sie oft andere Träume hat als ihr Freund. Sie findet ihr Leben langweilig und dann wird auch noch ihre Oma krank. Sie weiß nicht, was sie tun soll - und plötzlich macht sie eine Reise nach Tschechien.\n\nHape Kerkeling: Hape (Hans-Peter) Kerkeling ist ein Entertainer aus Deutschland. Der Film beschreibt seine Kindheit. Hans-Peter hat schon mit 9 Jahren viel Talent und seine Familie lacht über seine Witze. Die Mutter von Hans-Peter ist sehr krank und er möchte sie mit seinem Humor fröhlich machen. Aber sie stirbt viel zu jung. Der Film zeigt, dass Familie wichtig ist."
      },
      {
        "id": "l2",
        "title": "Über Filme sprechen",
        "type": "reading",
        "content": "Positiv:\n- Ich finde, die Schauspieler waren super.\n- Der Film hat wirklich toll gespielt.\n- Die Geschichte war sehr interessant.\n- Der Film war sehr lustig.\n- Die Filmmusik war sehr gut.\n- Sehr spannend!\n\nNegativ:\n- Der Film ist ein bisschen langweilig.\n- Das Ende hat mir nicht so gut gefallen.\n- Die Handlung ist nicht logisch.\n- Der Film hat mir überhaupt nicht gefallen.\n- Ich finde, dass der Film sehr lang war."
      }
    ]
  },
  {
    "id": "k10",
    "title": "Kapitel 10: Feste feiern",
    "description": "Ereignisse beschreiben, Gefühle ausdrücken.",
    "lessons": [
      {
        "id": "l1",
        "title": "Wichtige Ereignisse",
        "type": "reading",
        "content": "Die Hochzeit: die Ringe, das Fest, das Paar, das Brautkleid, glücklich, lieben.\n\nDer erste Schultag: die Schultüte, die Überraschung, der Schulranzen, aufgeregt sein, beginnen.\n\nNeu in der Firma: die Firma, die Getränke, die Kollegen, das Gebäck, kennenlernen.\n\nDie Geburt: das Baby, die Babykleidung, der Storch, schmücken, gratulieren.\n\nDer Führerschein: das Auto, nervös sein, die Prüfung.\n\nDer Marathon: die Medaille, die Siegerin, stolz sein, laufen, gewinnen."
      },
      {
        "id": "l2",
        "title": "Gefühle ausdrücken",
        "type": "reading",
        "content": "Ich bin glücklich, wenn ich mit Freunden feiern kann.\nIch bin nervös, wenn ich eine Prüfung habe.\nWenn ich einen Horrorfilm sehe, dann habe ich Angst.\nWenn meine Freundin wegfährt, bin ich traurig.\nIch bin genervt, wenn ich im Regen warten muss.\n\nWenn ich Geburtstag habe, dann feiere ich mit meiner Familie.\nWenn das Wetter schön ist, gehe ich spazieren.\nWenn ich müde bin, muss ich lachen."
      }
    ]
  },
  {
    "id": "k11",
    "title": "Kapitel 11: Glückwünsche",
    "description": "Glückwünsche aussprechen, sich bedanken.",
    "lessons": [
      {
        "id": "l1",
        "title": "Karten schreiben",
        "type": "reading",
        "content": "Liebe Julia, lieber Nils,\nWie schön, ihr heiratet! Herzlichen Glückwunsch zur Hochzeit! Wir wünschen euch alles Liebe für die Zukunft.\nHerzliche Grüße,\nMaxi, Ann und Jan\n\nLiebe Gäste,\nTausend Dank für die Blumen, Glückwünsche und Geschenke zu unserer Hochzeit!\nJulia & Nils\n\nWir gratulieren euch sehr herzlich! Herzlichen Dank für die Einladung.\nAlles Gute! Alles Liebe!"
      },
      {
        "id": "l2",
        "title": "Freude und Bedauern",
        "type": "dialogue",
        "content": "Freude ausdrücken:\n- Das gibt's doch nicht!\n- Ich freue mich auch!\n- Das ist ja toll!\n- Ich freue mich riesig.\n- So ein Glück!\n\nBedauern ausdrücken:\n- Schade!\n- Das tut mir wirklich leid.\n- Entschuldige, das darf doch nicht wahr sein!\n- So ein Pech!\n\nBeruhigen:\n- Das macht doch nichts.\n- Keine Sorge. Es geht schon wieder.\n- Hauptsache, wir feiern jetzt.\n- Es ist alles okay."
      }
    ]
  },
  {
    "id": "k12",
    "title": "Kapitel 12: Ein Fest im Norden",
    "description": "Über Veranstaltungen sprechen.",
    "lessons": [
      {
        "id": "l1",
        "title": "Die Kieler Woche",
        "type": "reading",
        "content": "Jedes Jahr im Juni findet in Norddeutschland die Kieler Woche statt. Sie ist weltweit bekannt und circa drei Millionen Besucher kommen zu diesem Ereignis nach Kiel.\n\nDie Kieler Woche ist eine Segelregatta und 4.000 Segler aus 70 Nationen nehmen an der größten Segelsport-Veranstaltung der Welt teil. Außerdem kann man auf der Kieler Woche viele alte Schiffe bewundern.\n\nEs gibt auch ein Sommerfest für Kinder und Erwachsene mit vielen Attraktionen. Wenn man Hunger und Durst hat, findet man dort viele internationale Spezialitäten.\n\nAuch Musikfans haben Spaß auf der Kieler Woche: Jedes Jahr finden über 400 Konzerte statt. Die Kieler Woche endet immer mit einem Feuerwerk. Alle freuen sich auf nächstes Jahr, weil es so schön war."
      },
      {
        "id": "l2",
        "title": "Über Veranstaltungen sprechen",
        "type": "reading",
        "content": "... ist bekannt für ...\n... findet immer im Juni/Herbst statt.\n... Menschen besuchen die Veranstaltung.\nMan kann dort ... sehen/machen/essen/hören.\nEs gibt dort immer ...\n... endet mit ...\n... macht sicher Spaß, weil ...\nDas Fest / Die Veranstaltung ist kostenlos. / Ein Ticket kostet ...\n\nWeitere Feste in D-A-CH:\n- Konstanzer Seenachtfest\n- Donauinselfest in Wien\n- Schwedenfest in Wismar\n- Hamburger Hafengeburtstag\n- Samba-Festival in Coburg\n- Street Parade in Zürich\n- Tollwood in München\n- Klassikfestival in Luzern"
      }
    ]
  },
  {
    "id": "k13",
    "title": "Kapitel 13: Im Ausland leben",
    "description": "Blogs verstehen und schreiben.",
    "lessons": [
      {
        "id": "l1",
        "title": "Paula in Argentinien",
        "type": "reading",
        "content": "Ich wollte schon lange ins Ausland und jetzt bin ich seit zwei Monaten in Argentinien. Es ist echt aufregend. Ich arbeite in einer Sprachschule und unterrichte Deutsch. Die Arbeit macht viel Spaß. Im Kurs ist es oft lustig und wir sprechen viel.\n\nManchmal vermisse ich meine Familie in Deutschland, besonders wenn jemand Geburtstag hat und ich nicht dabei sein kann. Aber ich habe auch hier schnell Freunde gefunden. Wenn ich sie treffe, ist meistens niemand pünktlich ... nur ich! Am Anfang war ich sauer, aber jetzt ist es schon normal für mich. Jetzt komme ich auch einfach später.\n\nMeine Freunde treffen sich meistens ziemlich spät, um 22 Uhr oder noch später. Sie erzählen viel und fragen auch nach Deutschland und Europa. Und ich freue mich, dass mein Spanisch viel besser geworden ist, das ist super! Auch an die andere Währung habe ich mich inzwischen gewöhnt."
      },
      {
        "id": "l2",
        "title": "Chandan in Kiel",
        "type": "reading",
        "content": "Ich komme aus Indien und bin seit dem Frühjahr in Kiel. Am Anfang war ich überrascht, dass manche Sachen so einfach sind, zum Beispiel die Anmeldung an der Uni oder im Wohnheim. Die Mitarbeiter waren freundlich und hilfsbereit und nirgends musste ich lange warten.\n\nMan sagt, dass die Deutschen so genau und ordentlich sind. Das stimmt sicher nicht immer, aber im Verkehr ist es richtig. Wenn der Bus um 9:12 Uhr abfahren soll, dann fährt er meistens auch um 9:12 Uhr ab.\n\nDas Leben hier gefällt mir eigentlich sehr gut. Am Anfang habe ich mich etwas fremd gefühlt und habe meine Freunde vermisst, aber jetzt fühle ich mich wohl. Die Studenten sind nett und ich habe neue Freunde gefunden. Sie haben mir schon viel gezeigt und finden es nicht schlimm, wenn ich etwas nicht verstehe.\n\nWenn meine Freunde Partys machen, bringt jeder etwas zu essen mit. So ist eine Party billiger, denn als Studenten haben wir natürlich nicht viel Geld."
      }
    ]
  },
  {
    "id": "sup1",
    "title": "Level 11: Backen mit Freunden",
    "description": "Supplementary content - Baking vocabulary and dialogues.",
    "lessons": [
      {
        "id": "l1",
        "title": "Plätzchen backen",
        "type": "dialogue",
        "content": "Maria: Hallo, John! Bist du heute bereit zu backen?\nJohn: Hallo, Maria! Ja, ich bin bereit. Was backen wir?\nMaria: Wir backen Plätzchen. Magst du Plätzchen?\nJohn: Ja, ich liebe Plätzchen! Was brauchen wir?\nMaria: Wir brauchen etwas Mehl, Zucker, Butter und Eier.\nJohn: Wie viel Mehl brauchen wir?\nMaria: Wir brauchen zwei Tassen Mehl.\nJohn: Ich kann es abmessen.\nMaria: Großartig! Ich hole den Zucker. Wir brauchen eine Tasse Zucker.\nJohn: Alles klar! Wo ist der Zucker?\nMaria: Der Zucker ist in der Speisekammer.\nMaria: Jetzt brauchen wir Butter.\nJohn: Wir brauchen einen Block Butter.\nMaria: Okay, ich hole die Butter.\nJohn: Verwenden wir auch Eier?\nMaria: Ja, wir brauchen zwei Eier.\nJohn: Ich kann die Eier aus dem Kühlschrank holen.\nMaria: Perfekt! Jetzt haben wir alles.\nMaria: Zuerst müssen wir Butter und Zucker vermischen.\nMaria: Als Nächstes fügen wir die Eier hinzu.\nJohn: Okay, ich werde die Eier in die Schüssel schlagen.\nMaria: Jetzt mische alles gut zusammen.\nMaria: Jetzt können wir das Mehl hinzufügen.\nJohn: Fügen wir das Mehl langsam hinzu?\nMaria: Ja, füge es langsam hinzu.\nMaria: Jetzt legen wir sie auf das Backblech.\nMaria: Wir müssen den Ofen auf 180 Grad einstellen.\nMaria: Wir backen sie etwa zehn Minuten."
      }
    ]
  },
  {
    "id": "sup2",
    "title": "Level 12: Alltag und Routinen",
    "description": "Supplementary content - Daily routines and activities.",
    "lessons": [
      {
        "id": "l1",
        "title": "Mein Tagesablauf",
        "type": "reading",
        "content": "Jeden Morgen stehe ich um sechs Uhr auf. Zuerst dusche ich und putze meine Zähne. Dann frühstücke ich: Brot mit Käse und eine Tasse Kaffee. Um halb acht fahre ich zur Arbeit. Mittags esse ich in der Kantine. Nach der Arbeit gehe ich einkaufen oder treffe Freunde. Abends koche ich und sehe fern. Um zehn Uhr gehe ich ins Bett."
      },
      {
        "id": "l2",
        "title": "Wochenende",
        "type": "dialogue",
        "content": "Eva: Was machst du am Wochenende?\nLukas: Am Samstag schlafe ich lange aus. Dann räume ich die Wohnung auf.\nEva: Und am Nachmittag?\nLukas: Ich gehe ins Fitnessstudio. Abends treffe ich Freunde.\nEva: Und am Sonntag?\nLukas: Sonntag ist mein Ruhetag. Ich lese ein Buch oder schaue Filme.\nEva: Das klingt entspannt. Ich muss leider arbeiten."
      }
    ]
  }
]